In [ ]:
# Date : 16/07/2024

In [1]:
import numpy as np

In [3]:
a = np.arange(15).reshape(3,5)
a

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [4]:
a.shape

(3, 5)

In [5]:
a.ndim

2

In [6]:
a.dtype

dtype('int64')

In [7]:
a.dtype.name

'int64'

In [8]:
a.itemsize

8

In [9]:
type(a)

numpy.ndarray

In [10]:
myList = [1,2,3,4,5]
b = np.array(myList)
b

array([1, 2, 3, 4, 5])

In [12]:
type(b)

numpy.ndarray

In [13]:
b.ndim

1

In [36]:
c = [1,4,65,8,0,23,7,7,2]
d = np.array(c).reshape(3,3)
d

array([[ 1,  4, 65],
       [ 8,  0, 23],
       [ 7,  7,  2]])

In [37]:
d.ndim

2

In [38]:
d.shape

(3, 3)

In [40]:
tup = (1, 4, 9, 12.45, "Shivam", 6620)
e = np.array(tup)
e

array(['1', '4', '9', '12.45', 'Shivam', '6620'], dtype='<U32')

In [41]:
e.dtype

dtype('<U32')

In [42]:
type(e)

numpy.ndarray

In [44]:
arr2d = np.array([[1,2], [2,1]])
arr2d

array([[1, 2],
       [2, 1]])

In [46]:
arr2d.ndim

2

In [50]:
arr3d = np.array([[[1,2,3], [4,5,6], [7,8,9]], [[9,8,7],[6,5,4], [3,2,1]]])
arr3d

array([[[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]],

       [[9, 8, 7],
        [6, 5, 4],
        [3, 2, 1]]])

In [51]:
arr3d.ndim

3

In [52]:
arr3d.shape

(2, 3, 3)

In [ ]:
# Date : 23/07/2024

In [43]:
# Write a python code to store the given values in tuples and display in 
# the given format by using the user defined function named 'printString'

template = "{0:s} has {1:.2f}% in the class {2:s}"
print("Template string : ", template)

def printString(str, tup):
    print(str.format(tup[0], tup[1], tup[2]))

listTuple = [
    ("Amit", 45, "TY"),
    ("Sumit", 25, "SY"),
    ("Anita", 24, "FY")
]

for item in listTuple:
    printString(template, item)

Template string :  {0:s} has {1:.2f}% in the class {2:s}
Amit has 45.00% in the class TY
Sumit has 25.00% in the class SY
Anita has 24.00% in the class FY

In [57]:
a = [i for i in range(5)]
b = range(5)
c = range(0,10)

print(a)
print(b)
print(c)

[0, 1, 2, 3, 4]
range(0, 5)
range(0, 10)

In [64]:
d = list(range(5))
print(d)

print(list(range(0, 20, 2)))

print(list(range(5, 0, -1)))

[0, 1, 2, 3, 4]
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
[5, 4, 3, 2, 1]

In [67]:
# Write a python code to store and display the square of odd numbers upto 10. 
# Generate th odd number using range function.

list = []
for i in range(1, 10, 2):
    list.append(i*i)

print(list)

[1, 9, 25, 49, 81]

In [89]:
# Create a python dictionary from the given sequences.
# Sequences:
# keyList =['fy','sy','ty']
# vlaueList=[[1,2,3],[4,5,6],[7,8,9]]

keyList =['fy','sy','ty']
vlaueList=[[1,2,3],[4,5,6],[7,8,9]]

myDict = {}
for key, value in zip(keyList, valueList):
    myDict[key] = value

myDict

{'fy': [1, 2, 3], 'sy': [4, 5, 6], 'ty': [7, 8, 9]}

In [90]:
print("Keys : ", myDict.keys())
print("Values : ", myDict.values())

myDict['ty'] = [11,12,13]
print(myDict)

print("Poped value for key 'sy': ", myDict.pop('sy'))
print(myDict)

Keys :  dict_keys(['fy', 'sy', 'ty'])
Values :  dict_values([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
{'fy': [1, 2, 3], 'sy': [4, 5, 6], 'ty': [11, 12, 13]}
Poped value for key 'sy':  [4, 5, 6]
{'fy': [1, 2, 3], 'ty': [11, 12, 13]}

In [3]:
# for the following data create the dictionary of the alpha bitwise list of fruits
# ['apple', 'banana', 'blue berry', 'apricot', 'orange', 'pine apple']
# Expected output

expectOutput = { 'a': ['apple', 'appricot'],
  'b': ['banana', 'blue berry'], 
  'o': ['orange'], 
  'p': ['pine apple']
}

fruits = ['apple', 'banana', 'blue berry', 'appricot', 'orange', 'pine apple']
fruitDict = {}
for fruit in fruits:
    letter = fruit[0]
    if letter not in fruitDict:
        fruitDict[letter] = [fruit]
    else:
        fruitDict[letter].append(fruit)

fruitDict

{'a': ['apple', 'appricot'],
 'b': ['banana', 'blue berry'],
 'o': ['orange'],
 'p': ['pine apple']}

In [44]:
# Sets

a = {1, 2, 3, 4, 5}
b = {3, 4, 5, 6, 7}

a.add(10)
print("a : " , a)
a.remove(10)
print("a : " , a)


print("Union : ", a.union(b)) # a | b
print("a : " , a)
a.update(b) # a |= b
print("a : " , a)
print("Interscetion : ", a.intersection(b)) # a & b
a.intersection_update(b) # a &= b
print("a : " , a)

print("Resetting a")
a = {1, 2, 3, 4, 5}

a :  {1, 2, 3, 4, 5, 10}
a :  {1, 2, 3, 4, 5}
Union :  {1, 2, 3, 4, 5, 6, 7}
a :  {1, 2, 3, 4, 5}
a :  {1, 2, 3, 4, 5, 6, 7}
Interscetion :  {3, 4, 5, 6, 7}
a :  {3, 4, 5, 6, 7}
Resetting a

In [1]:
# 8, 9, 11, 23, 34, 10
# From the given list sum the elements thtabare greater tha 10

list1 = [8, 9, 11, 23, 34, 10]
sum([i for i in list1 if i > 10])

68

In [45]:
strList = ["Bharati", "Aasha", "Easy", "Code"]

set(len(item) for item in strList)

{4, 5, 7}

In [50]:
def calculate (numList):
    square = [item*item for item in numList]
    cube = [item*item*item for item in numList]
    return square, cube 

numList = [1,2,3,4,5]
square, cube = calculate(numList)
print("Square : ", square)
print("Cube : ", cube)

Square :  [1, 4, 9, 16, 25]
Cube :  [1, 8, 27, 64, 125]

In [ ]:
# Date : 30/07/2024

In [2]:
object = ["Apple", "Bat", "Chicken", "Dumpyard", "Erangel", "Friangi"]

objectLen = dict()

for item in object:
    objectLen[item] = len(item)
    
objectLen

{'Apple': 5, 'Bat': 3, 'Chicken': 7, 'Dumpyard': 8, 'Erangel': 7, 'Friangi': 7}

In [26]:
import re

name = [".Manish      ", "     Hardik4!", "Akshay#$", "Shreelaxmee!", "12Rohan", "An      jana"]

def clean_strings(strings):
    result = []
    for value in strings:
        value = value.strip()
        value = re.sub('[ !$#?.0-9]', '', value)
        value = value.title()
        result.append(value)
    return result
    
clean_strings(name)

['Manish', 'Hardik', 'Akshay', 'Shreelaxmee', 'Rohan', 'Anjana']

In [23]:
add = lambda x:  x+x # One argument
add(5)

10

In [24]:
add = lambda x, y:  x+y # Two argument
add(5, 10)

15

In [25]:
solveQuadEq = lambda a, b, c, x: a*x**2 + b*x + c  # Multi argument
solveQuadEq(5, 6, 7, x = 2)

39

In [ ]:
# PANDAS - 30/07/2024

In [36]:
import pandas as pd

name = pd.Series(
    ['Manish', 'Hardik', 'Akshay', 'Shreelaxmee', 'Rohan', 'Anjana'], 
    index=['a', 'b', 'c', 'd', 'e', 'f']
)
name

a         Manish
b         Hardik
c         Akshay
d    Shreelaxmee
e          Rohan
f         Anjana
dtype: object

In [42]:
data = {
    'roll_no' : [6620, 6621, 6622, 6624, 6625, 6626, 6627, 6628],
    'name': ['shivam', 'ganesh', 'dinesh', 'ramesh', 'dhanesh', 'mayuresh', 'deepesh', 'nilesh'],
    'class': ['MSc-IT','MSc-IT','MSc-IT','MSc-IT','MSc-IT','MSc-IT','MSc-IT','MSc-IT']
}

df = pd.DataFrame(data)
df

   roll_no      name   class
0     6620    shivam  MSc-IT
1     6621    ganesh  MSc-IT
2     6622    dinesh  MSc-IT
3     6624    ramesh  MSc-IT
4     6625   dhanesh  MSc-IT
5     6626  mayuresh  MSc-IT
6     6627   deepesh  MSc-IT
7     6628    nilesh  MSc-IT

In [43]:
df.head()

   roll_no     name   class
0     6620   shivam  MSc-IT
1     6621   ganesh  MSc-IT
2     6622   dinesh  MSc-IT
3     6624   ramesh  MSc-IT
4     6625  dhanesh  MSc-IT

In [44]:
df.tail()

   roll_no      name   class
3     6624    ramesh  MSc-IT
4     6625   dhanesh  MSc-IT
5     6626  mayuresh  MSc-IT
6     6627   deepesh  MSc-IT
7     6628    nilesh  MSc-IT

In [45]:
df.head(3)

   roll_no    name   class
0     6620  shivam  MSc-IT
1     6621  ganesh  MSc-IT
2     6622  dinesh  MSc-IT

In [46]:
df.tail(3)

   roll_no      name   class
5     6626  mayuresh  MSc-IT
6     6627   deepesh  MSc-IT
7     6628    nilesh  MSc-IT

In [47]:
df.describe()

           roll_no
count     8.000000
mean   6624.125000
std       2.900123
min    6620.000000
25%    6621.750000
50%    6624.500000
75%    6626.250000
max    6628.000000

In [63]:
print("---------- 1 ----------\n",  df['name'])
#  or 
print("\n---------- 2 ----------\n", df.name)

---------- 1 ----------
 0      shivam
1      ganesh
2      dinesh
3      ramesh
4     dhanesh
5    mayuresh
6     deepesh
7      nilesh
Name: name, dtype: object

---------- 2 ----------
 0      shivam
1      ganesh
2      dinesh
3      ramesh
4     dhanesh
5    mayuresh
6     deepesh
7      nilesh
Name: name, dtype: object

In [64]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [66]:
df.dtypes

roll_no     int64
name       object
class      object
dtype: object